Revit 2026 API

# MaterialCutBackgroundPatternId Property

---

The id of the FillPatternElement used as the background pattern of faces with this material in cut views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId CutBackgroundPatternId { get; set; }
```
```vb
Public Property CutBackgroundPatternId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ CutBackgroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member CutBackgroundPatternId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The element id must represent a valid FillPatternElement. -or- When setting this property: The FillPattern target must be a drafting pattern. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The FillPattern used for a cut pattern must have a 'Drafting' target.

#### Reference

Material Class

Autodesk.Revit.DB Namespace